In [2]:
import numpy as np
import pandas as pd

from numpy.random import randn

np.random.seed(101)
df = pd.DataFrame(randn(5,4), ['a', 'b', 'c', 'd', 'e'], [1,2,3,4])

a dataframe is a collection of series. basically, every column is a series. if we call one column of the dataframe, we get a series in return. if we mention multiple columns, it returns a subset of the dataframe.

when passing multiple columns, send them as a list

In [5]:
df.head(2)

          1         2         3         4
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

In [3]:
df[[1,2]]

          1         2
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

we can add new columns by simply specifying the column if it alreayd exists and assigning values to it.
remove columns by df.drop(<column_name>)

In [12]:
df['new'] = df[1] + df[2]
df

          1         2         3         4       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

df.drop(<column_name>, <axis, default to 0(rows)>)
this function returns a new dataframe, doesn't change the old dataframe
To make change in place, pass parameter: inplace=True

In [14]:
df.drop('new', axis=1)

          1         2         3         4
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

selecting rows in a dataframe is a bit more annoying. we do df.loc[<row_name>] or df.iloc[<index of the row, independent from the label>]

In [18]:
df.loc[['a','c']]

          1         2         3         4       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
c -2.018168  0.740122  0.528813 -0.589001 -1.278046

In [20]:
df.iloc[[1,3]]

          1         2         3         4       new
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177

we can also specify rows and columns using the loc function

In [23]:
df.loc['a',2]

0.6281327087844596

In [25]:
df.loc[['a','d'], [3,'new']]

          3       new
a  0.907969  3.334983
d -0.933237 -0.570177

we can use logical operators to compare every element of the dataframe and we get another dtaframe in return. pretty cool, ngl.

not just that, any arithmetic operation works too.

then there's something really cool.

In [30]:
bool_df = df > 0

df[bool_df]

          1         2         3         4       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118       NaN       NaN  0.605965  0.331800
c       NaN  0.740122  0.528813       NaN       NaN
d  0.188695       NaN       NaN  0.955057       NaN
e  0.190794  1.978757  2.605967  0.683509  2.169552

here, df[bool_df] returns a dataframe with only those elements whose corresponding values in bool_df were true, and NaN everywhere else.

something cooler:

In [33]:
df[df[1] > 0]

          1         2         3         4       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

df[1] > 0 returns a series of boolean values. when we pass that as an index to df, it only prints those rows which are true.


furthermore, we can make compound conditionals, but using & to perform and between two series. | for or

In [36]:
df[(df[1] > 0) & (df['new'] < 3)]

          1         2         3         4       new
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552